<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072; (&#1041;&#1088;&#1086;&#1076;&#1086;&#1074;&#1089;&#1082;&#1080;&#1081; &#1040;.&#1045;. &#1048;&#1055;&#1054;-14&#1072;)</title><meta name="generator" content="DocBook XSL Stylesheets V1.68.1"><link rel="start" href="boom.html" title="&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072; (&#1041;&#1088;&#1086;&#1076;&#1086;&#1074;&#1089;&#1082;&#1080;&#1081; &#1040;.&#1045;. &#1048;&#1055;&#1054;-14&#1072;)"><link rel="next" href="ar01s02.html" title="&#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; 2 - &#1055;&#1086;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1080;&#1075;&#1088;&#1077;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072; (&#1041;&#1088;&#1086;&#1076;&#1086;&#1074;&#1089;&#1082;&#1080;&#1081; &#1040;.&#1045;. &#1048;&#1055;&#1054;-14&#1072;)</th></tr><tr><td width="20%" align="left"> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="ar01s02.html">Next</a></td></tr></table><hr></div><div class="article" lang="en"><div class="titlepage"><div><div><h1 class="title"><a name="id582609"></a>&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072; (&#1041;&#1088;&#1086;&#1076;&#1086;&#1074;&#1089;&#1082;&#1080;&#1081; &#1040;.&#1045;. &#1048;&#1055;&#1054;-14&#1072;)</h1></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="section"><a href="boom.html#id582673">&#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; 1 - &#1055;&#1086;&#1073;&#1077;&#1076;&#1072; &#1074; &#1080;&#1075;&#1088;&#1077;</a></span></dt><dt><span class="section"><a href="ar01s02.html">&#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; 2 - &#1055;&#1086;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1080;&#1075;&#1088;&#1077;</a></span></dt><dt><span class="section"><a href="ar01s03.html">&#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; 3 - &#1048;&#1075;&#1088;&#1086;&#1074;&#1086;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;</a></span></dt></dl></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="id582673"></a>&#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; 1 - &#1055;&#1086;&#1073;&#1077;&#1076;&#1072; &#1074; &#1080;&#1075;&#1088;&#1077;</h2></div></div></div><p>&#1054;&#1090;&#1082;&#1088;&#1099;&#1074; &#1074;&#1089;&#1077; «&#1085;&#1077; &#1079;&#1072;&#1084;&#1080;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;» &#1103;&#1095;&#1077;&#1081;&#1082;&#1080;, &#1080;&#1075;&#1088;&#1086;&#1082; &#1074;&#1099;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;. &#1048;&#1075;&#1088;&#1072; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;&#1081; &#8212; &#1082;&#1088;&#1080;&#1074;&#1072;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1090;&#1072;&#1082;&#1086;&#1081;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1083;&#1089;&#1103; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1080;&#1075;&#1088;&#1072;&#1077;&#1090;&#1077; &#1074; &#1088;&#1091;&#1089;&#1089;&#1082;&#1091;&#1102; &#1088;&#1091;&#1083;&#1077;&#1090;&#1082;&#1091; &#8212; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1085;&#1077; &#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;. &#1055;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1075;&#1088;&#1086;&#1082;&#1086;&#1074; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1074; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1075;&#1088;&#1072;&#1090;&#1100; &#1089;&#1080;&#1083;&#1100;&#1085;&#1077;&#1077; &#1087;&#1088;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1082;&#1091; &#1080;&#1083;&#1080; &#1087;&#1088;&#1080; &#1095;&#1080;&#1089;&#1090;&#1086; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1088;&#1077;&#1074;&#1086;&#1089;&#1093;&#1086;&#1076;&#1089;&#1090;&#1074;&#1077; (&#1080;&#1083;&#1080; &#1074; &#1083;&#1086;&#1074;&#1082;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;). &#1050;&#1086;&#1075;&#1076;&#1072; &#1088;&#1103;&#1076; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080;&#1075;&#1088; &#1076;&#1077;&#1083;&#1072;&#1083;&#1080; &#1090;&#1091;&#1088;&#1085;&#1080;&#1088;&#1085;&#1099;&#1084;&#1080;, &#1073;&#1099;&#1083;&#1072; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072; &#1083;&#1080;&#1075;&#1072; DCI (&#1082;&#1088;&#1091;&#1087;&#1085;&#1099;&#1084; &#1080;&#1075;&#1088;&#1086;&#1074;&#1099;&#1084; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1086;&#1084;). &#1058;&#1072;&#1082; &#1074;&#1086;&#1090;, &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1083;&#1086;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099;&#1074;&#1072;&#1090;&#1100; &#1074; &#1091;&#1093;&#1086;&#1076; &#1086;&#1090; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081; &#1085;&#1072; &#1083;&#1086;&#1074;&#1082;&#1086;&#1089;&#1090;&#1100; &#8212; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072; &#1083;&#1080;&#1075;&#1080; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1086;&#1077;&#1076;&#1080;&#1085;&#1086;&#1082;.</p><p>&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1080;&#1075;&#1088;&#1099; &#1089; &#1087;&#1086;&#1083;&#1077;&#1084; &#1080;/&#1080;&#1083;&#1080; &#1103;&#1095;&#1077;&#1081;&#1082;&#1072;&#1084;&#1080; &#1085;&#1077;&#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1099;, &#1080;&#1083;&#1080; &#1074; &#1090;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;, &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099;. &#1055;&#1088;&#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1088;&#1072;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072;&#1093; &#1084;&#1080;&#1085; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100; &#1080;&#1093; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1080; &#1080;&#1075;&#1088;&#1086;&#1082; &#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1103;&#1095;&#1077;&#1081;&#1082;&#1080; &#1085;&#1072;&#1091;&#1075;&#1072;&#1076;. &#1057;&#1072;&#1087;&#1105;&#1088; &#1080;&#1084;&#1077;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1089;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1087;&#1086;&#1083;&#1077; &#1091;&#1078;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;, &#1090;&#1086; &#1080;&#1075;&#1088;&#1086;&#1082; &#1085;&#1077; &#1074;&#1079;&#1086;&#1088;&#1074;&#1077;&#1090;&#1089;&#1103; (&#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1085;&#1072; &#1085;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1082;&#1091;&#1089;&#1086;&#1082; &#1087;&#1086;&#1083;&#1103;), &#1090;&#1082;&#1085;&#1091;&#1074; &#1085;&#1072;&#1091;&#1075;&#1072;&#1076;.</p><pre class="programlisting">function  win() {
      if (inPlay == 0) {
          if (selec == 1) {
              selec = 9;
              inPlay = 1;
          }
      } else {
          if (missileY == 99) {
              missileY = 18;
          }
      }
    }
    </pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="ar01s02.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"> </td><td width="40%" align="right" valign="top"> &#1057;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; 2 - &#1055;&#1086;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1080;&#1075;&#1088;&#1077;</td></tr></table></div></body></html>
